Let's start by importing pandas. The convention is to alias it as *pd*, but that's optional.

In [1]:
import pandas as pd

## Basic Operations

For basic operations we'll create a toy dataset in Python, both literally and figuratively.

In [2]:
toy_data = { 0: {'toy_type': 'car', 'weight': 12, 'size': 9 },
             1: {'toy_type': 'rocking horse', 'weight': 147, 'size': 82 },
             2: {'toy_type': 'ball', 'weight': 44, 'size': 31 },
             3: {'toy_type': 'plastic brick', 'weight': 1, 'size': 2 },
             4: {'toy_type': 'spinning top', 'weight': 6, 'size': 4 }
           }
toys = pd.DataFrame.from_dict(toy_data,orient='index')
toys.head()

   weight       toy_type  size
0      12            car     9
1     147  rocking horse    82
2      44           ball    31
3       1  plastic brick     2
4       6   spinning top     4

### Extracting Values
#### Extract all values from one column

In [3]:
toys['toy_type'] # produces a pandas Series

0              car
1    rocking horse
2             ball
3    plastic brick
4     spinning top
Name: toy_type, dtype: object

Note: the below is also valid:

    toys.toy_type

because pandas will automatically create properties for each column.

However, I would advise against this, because you never know when a column might have the same name as a valid pandas operation. For example, let's say we have a new column called 'shape' to describe the shape of a toy. In this case, when you type

    toys.shape

pandas **won't** return a Series of all the values in the shape column. Instead, it will give you the tuple that tells you how many rows, columns you have (which is the default .shape property in pandas).

By using the square bracket notation to access columns, you avoid this kind of confusion.

#### Extract all values from multiple columns

In [4]:
toys[['toy_type', 'weight']] # produces a pandas DataFrame

        toy_type  weight
0            car      12
1  rocking horse     147
2           ball      44
3  plastic brick       1
4   spinning top       6

#### Extract all values from a single row

Selecting by row number:

In [5]:
toys.iloc[0,:] # produces a Pandas series

weight       12
toy_type    car
size          9
Name: 0, dtype: object

If you want to select by index:

In [6]:
toys.ix[0] # produces a pandas Series

weight       12
toy_type    car
size          9
Name: 0, dtype: object

#### Extract multiple rows

In [7]:
toys.iloc[0:2,:] # produces a pandas DataFrame

   weight       toy_type  size
0      12            car     9
1     147  rocking horse    82

Note, selecting by index includes the last number (3 rows instead of 2 as in the example above)

In [8]:
toys.ix[0:2] # produces a pandas DataFrame

   weight       toy_type  size
0      12            car     9
1     147  rocking horse    82
2      44           ball    31

#### Extract a subset of rows and columns

Lots of ways to do this!

Indexing by row/column number

In [9]:
toys.iloc[0:2,1:3] # first 2 rows, second 2 columns

        toy_type  size
0            car     9
1  rocking horse    82

Indexing by index and column names

In [10]:
toys.loc[0:2,["size", "toy_type"]]

   size       toy_type
0     9            car
1    82  rocking horse
2    31           ball

Or indexing using `ix`, although this is apparently reserved for [special cases](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.ix.html). It's best to be specific and use `loc` or `iloc`

In [11]:
toys.ix[1:3][['size', 'weight']] # produces a pandas DataFrame
toys[['size', 'weight']].ix[1:3] # this is equivalent to the above

   size  weight
1    82     147
2    31      44
3     2       1

### Conditional Selection
#### Filter on single condition

In [12]:
toys[toys['size'] > 5]

   weight       toy_type  size
0      12            car     9
1     147  rocking horse    82
2      44           ball    31

Or limit the columns returned from the above

In [13]:
toys.loc[toys['size'] > 5, "size"]

0     9
1    82
2    31
Name: size, dtype: int64

#### Filter on multiple conditions
Things to remember:
* put brackets around each condition
* use bitwise and (&) and bitwise or (|) to chain conditions, NOT 'and' or 'or'

In [14]:
toys[(toys['size'] > 5) & (toys['weight'] < 40)]

   weight toy_type  size
0      12      car     9

#### Filter, then extract a subset

In [15]:
# type and size of the first toy with a size greater than 5
toys.loc[toys['size'] > 5,['toy_type', 'size']].iloc[0]

toy_type    car
size          9
Name: 0, dtype: object

## Real Data

Now that we've done some basic operations on a toy dataset, let's see how to work with 'real' datasets.

It's a cop out, but I'll use the Titanic dataset from Kaggle (available here: https://www.kaggle.com/c/titanic)

Let's read in our csv file:

In [16]:
# read in our dataset from a .csv file
df = pd.read_csv('titanic.csv')

 We could easily read in another kind of file with a different method, e.g. Excel:

    pd.read_excel(...)

#### DataFrame quick overview
Let's have a quick look at our dataset to begin with. One way is just to look at the first 5 rows:

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

This is fine for 12 variables. What if we have 100? We could look at the column names and datatypes to get an idea of the data instead:

In [18]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

This is a more intuitive way to see what kind of columns we're dealing with.

For even more information, you can also use .info():

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

#### Show number of nulls per column
This is great because we can figure out which columns have missing values. To make this easier for large datasets, you can do something like:

In [20]:
for c in df.columns:
    print('{0} has {1} nulls'.format(c, len(df[df[c].isnull()])))

PassengerId has 0 nulls
Survived has 0 nulls
Pclass has 0 nulls
Name has 0 nulls
Sex has 0 nulls
Age has 177 nulls
SibSp has 0 nulls
Parch has 0 nulls
Ticket has 0 nulls
Fare has 0 nulls
Cabin has 687 nulls
Embarked has 2 nulls

Let's break that down.

We'll loop through the columns, which is just a Python list. For each of the columns, we're retrieving the Pandas Series just for that column, then extracting the missing values using

    df[c].isnull()

This just gives us a list of True/False values, which we use to re-index the DataFrame (to extract only the values where .isnull() is True):

    df[df[c].isnull()]

The length of this is then the number of missing values for that column.

Or we could make our lives easier:

In [21]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## Data Wrangling

#### Show rows with missing values

In [22]:
df[df.isnull().any(axis=1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

#### Fill in missing values
One common thing to do is use the mean value to fill in missing values. Let's do that. We'll also round so we don't get non-integer values.

In [23]:
df['Age'].fillna(round(df['Age'].mean(), 0), inplace=True)
# let's verify that it worked:
print('Age has {0} nulls'.format(len(df[df['Age'].isnull()])))

Age has 0 nulls

Note: `.fillna()` is used to fill in the missing values, but on its own it returns a copy of the DataFrame or Series.

To ensure the changes are actually made, use `inplace=True` or assign the value back to the original variable:

`df = df.fillna(...)`

#### Create new columns using existing values
For example, let's create two new columns based on age. One that's just double the age, and on for "ideal partner age" using the old, anecdotal "half your age plus seven" ahem... "algorithm".

In [24]:
df['DoubleAge'] = df['Age'] * 2 # simple vectorised operation
df['IdealPartnerAge'] = df['Age'].map(lambda x: int((x/2) + 7)) # more complex operation, using .map()
df['IdealPartnerAge'] = df['Age'].apply(lambda x: int((x/2) + 7)) # same as the above, using .apply()
df[['Age', 'DoubleAge', 'IdealPartnerAge']].head()

    Age  DoubleAge  IdealPartnerAge
0  22.0       44.0               18
1  38.0       76.0               26
2  26.0       52.0               20
3  35.0       70.0               24
4  35.0       70.0               24

#### Drop a column
Things to remember:
* Again, this returns a copy by default so use inplace=True
* Use axis=1 to drop a column rather than a row

In [25]:
df.drop('Cabin', axis=1, inplace=True)

#### Drop rows with NA values in a specific column

In [26]:
df.dropna(axis=0, subset=['Embarked'], inplace=True)